In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from config import db_name
from config import host
from config import port
from config import username
from config import password

In [2]:
engine = create_engine(f'postgresql://{username}:{password}@{host}:{port}/{db_name}')
connection = engine.connect()

In [7]:
salary_title_df = pd.read_sql(
    'SELECT e.emp_no, t.title, s.salary FROM title t JOIN employee e ON t.title_id=e.emp_title_id JOIN salary s ON e.emp_no = s. emp_no;',
    connection
)

In [8]:
salary_title_df

        emp_no            title  salary
0        10005            Staff   78228
1        10010         Engineer   72488
2        10011            Staff   42365
3        10018  Senior Engineer   55881
4        10035  Senior Engineer   41538
...        ...              ...     ...
300019  499963  Senior Engineer   49383
300020  499972  Senior Engineer   41002
300021  499985            Staff   40000
300022  499987            Staff   52282
300023  499998            Staff   40000

[300024 rows x 3 columns]